app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
  	book = Book.find(params[:id]) #データ(レコード)を1件取得
    book.destroy

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2020-07-16 05:26:18.484698"], ["updated_at", "2020-07-16 05:26:18.484698"]]
---
  def create

    @books = Book.all
    @book = Book.new(book_params)
    if @book.save